Repository: JahongirHakimjonov/ShopBot
Catalog: locale/*/LC_MESSAGES/django.po
Languages: uz

source: User not found.
uz: Foydalanuvchi topilmadi.

source: Cart is empty.
uz: Savatcha bo'sh

source: pieces
uz: dona

source: Home
uz: Bosh sahifa

source: Clear
uz: Tozalash

source: Order
uz: Buyurtma berish

source: Total
uz: Jami

source: Your cart
uz: Savatchangiz

source: Save
uz: Saqlash

source: Total amount
uz: Jami summa

source: Invalid selection format or item not found.
uz: Yaroqsiz tanlov formati yoki element topilmadi.

source: Invalid selection.
uz: Yaroqsiz miqdor tanlandi.

source: Item not found.
uz: Element topilmadi.

source: Quantity cannot be less than 1.
uz: Miqdor 1 dan kichik bo‘lishi mumkin emas.

source: Item removed from cart.
uz: Mahsulot savatdan olib tashlandi.

source: Changes saved.
uz: O‘zgarishlar saqlandi.

source: Cart is cleared.
uz: Savat tozalandi.

source: No donation options available.
uz: Donat ma'lumotlari mavjud emas.

source: Cancel
uz: Bekor qilish.

source: Please select a donation amount:
uz: Donat miqdorini tanlang:

source: Back
uz: Ortga

source: Please select a payment method to complete your donation of {amount}:
uz: {amount} miqdoridagi donatni yakunlash uchun toʻlov usulini tanlang:

source: Click the button below to complete your donation of {amount}:
uz: {amount} miqdoridagi donatni yakunlash uchun quyidagi tugmani bosing:

source: Donation canceled.
uz: Donat bekor qilindi.

source: Returning to donation options.
uz: Donat variantlariga qaytish.

source: Invalid donation option.
uz: Donat varianti yaroqsiz.

source: Donation amount selected.
uz: Donat miqdori tanlangan.

source: Unrecognized action.
uz: Noma'lum harakat.

source: Order not found.
uz: Buyurtma topilmadi

source: Returning to payment selection.
uz: To‘lovni tanlashga qaytish.

source: Invalid payment data.
uz: To‘lov ma’lumotlari xato.

source: Unrecognized payment method.
uz: Tan olinmagan to‘lov usuli.

source: No help available.
uz: Yordam xizmati mavjud emas.

source: Search Products
uz: So'nggi mahsulotlar.

source: No info available.
uz: Hech qanday axborot mavjud emas.

source: Language updated successfully!
uz: Til yangilandi!

source: Send location
uz: Joylashuvni yuborish

source: Please, send your location.
uz: Iltimos, joylashuvingizni yuboring.

source: Invalid location data. Please try again.
uz: Joylashuv axboroti yaroqsiz. Qayta urining.

source: Send your phone
uz: Telefoningizni yuboring

source: Please, send your phone number.
uz: Iltimos, telefon raqamingizni yuboring.

source: Invalid contact information. Please try again.
uz: Kontakt axboroti yaroqsiz. Qayta urining.

source: I've saved your phone number.
uz: Telefon raqamingizni saqlab qo‘ydim.

source: Please, select a payment method.
uz: To'lov turini tanlang.

source: Invalid payment method selected.
uz: Yaroqsiz to'lov turi tanlandi.

source: Error retrieving your cart.
uz: Savatingizni olishda xatolik yuz berdi.

source: You selected the Click payment method. The payment process is starting. Amount: {}
uz: Click to‘lov usulini tanladingiz. To‘lov jarayoni boshlanmoqda. Summa: {}

source: You selected the Payme payment method. The payment process is starting. Amount: {}
uz: Payme to‘lov usulini tanladingiz. To‘lov jarayoni boshlanmoqda. Summa: {}

source: Pay
uz: To'lash

source: Products
uz: Mahsulotlar

source: Thanks
uz: Rahmat

source: Read
uz: O‘qish

source: This bot respects your privacy. By using this bot, you agree to our privacy policy. For more details, please read our full privacy policy by clicking the button below.
uz: Bu bot maxfiyligingizni hurmat qiladi. Bu botdan foydalanish orqali maxfiylik siyosatimizga rozilik bildirasiz. Tafsilotlar uchun quyidagi tugmani bosib, maxfiylik siyosatimizni to‘liq o‘qing.

source: No products available.
uz: Hech qanday mahsulot mavjud emas.

source: Cart
uz: Savatcha

source: Please select a category:
uz: Turkumni tanlang:

source: Welcome to the bot!
uz: Botga xush kelibsiz!

source: Please select a product:
uz: Mahsulotni tanlang:

source: Product not found.
uz: Mahsulot topilmadi.

source: Product is out of stock.
uz: Mahsulot zaxirada qolmagan.

source: {title} {description} Price: *{price} UZS*
uz: {title} {description} Narxi: *{price} UZS*

source: Please select the quantity:
uz: Miqdorni tanlang:

source: Invalid quantity selected.
uz: Yaroqsiz miqdor tanlandi.

source: Product added to cart.
uz: Mahsulot savatchaga saqlandi.

source: Language
uz: Til

source: Info
uz: Ma’lumot

source: Donate
uz: Donat

source: Unknown command.
uz: Noma’lum komanda.

source: Unknown action.
uz: Noma’lum harakat.

source: Payme Payment was successful. See latest products
uz: Payme Payment amalga oshdi. Oxirgi mahsulotlar bilan tanishing

source: Click Payment was successful. See latest products
uz: Click Payment amalga oshdi. Eng oxirgi mahsulotlar bilan tanishing

source: Welcome to the bot! You can search for products by clicking on the button below.
uz: Botga xush kelibsiz! Quyidagi tugmani bosish orqali mahsulotlarni qidirishingiz mumkin.

source: [{first_name}](tg://user?id={message.from_user.id}) Welcome to the bot! You can search for products by clicking on the button below.
uz: [{first_name}] (tg://user?id={message.from_user.id}) Botga xush kelibsiz!

source: An error occurred.
uz: Xatolik yuz berdi.

source: You are making request too often
uz: Juda ko‘p so‘rov yuboryapsiz

source: Created at
uz: Yaratilgan sana:

source: Updated at
uz: Yangilangan sana:

source: Analytics
uz: Analitika

source: Settings
uz: Sozlamalar

source: All
uz: hammasi

source: New
uz: Yangi

source: Last week revenue
uz: O‘tgan hafta daromadi

source: Last week expenses
uz: O‘tgan hafta xarajatlari

source: Status
uz: Buyurtma holati

source: Payment Method
uz: To‘lov turi

source: Order Type
uz: Buyurtma turi

source: Role
uz: Rol

source: User
uz: Foydalanuvchi

source: Amount
uz: Miqdor

source: Carts
uz: Aravalar

source: Product
uz: Mahsulot

source: Quantity
uz: Miqdor

source: Cart item
uz: Savatcha buyumi

source: Cart items
uz: Savat buyumlari

source: Name
uz: Nomi

source: Is Active
uz: Faol

source: Category
uz: Toifa

source: Categories
uz: Turkumlar

source: Type
uz: Tur

source: Is active
uz: Faol

source: Chat
uz: Suhbat

source: Chats
uz: Chatlar

source: Donates
uz: Xayriya qiladi

source: Title
uz: Sarlavha

source: Description
uz: Tavsif

source: Help
uz: Yordam

source: Image
uz: Tasvir

source: Infos
uz: Ma’lumot

source: News
uz: Yangiliklar

source: URL
uz: URL manzil

source: News Button
uz: Yangiliklar tugmasi

source: News Buttons
uz: Yangiliklar tugmalari

source: Pending
uz: Kutilmoqda

source: Completed
uz: Bajarildi

source: Cancelled
uz: Bekor qilindi

source: Payment Status
uz: To‘lov holati

source: Orders
uz: Buyurtmalar

source: Order Item
uz: Buyurtma buyumi

source: Order Items
uz: Buyurtma elementlari

source: Price
uz: Narx

source: Admin
uz: Administrator

source: Uzbek
uz: o‘zbek

source: Russian
uz: Rossiya

source: Username
uz: Foydalanuvchi nomi

source: First Name
uz: Ismi

source: Last Name
uz: Familiya

source: Full Name
uz: To'liq ismi

source: Phone Number
uz: Telefon raqami

source: Bot User
uz: Bot Foydalanuvchi

source: Bot Users
uz: Bot Foydalanuvchilari

source: Your order has been successfully paid. Order ID: {order_id}
uz: Buyurtmangiz to‘langan. Buyurtma ID: {order_id}

source: Your order has been cancelled. Order ID: {order_id}
uz: Buyurtmangiz bekor qilindi. Buyurtma ID: {order_id}

source: Django site admin
uz: Django sayti administratori

source: Django administration
uz: Django boshqaruvi

source: Last 7 days
uz: Oxirgi 7 kun

source: Product performance in last 28 days
uz: Oxirgi 28 kun ichida mahsulot unumdorligi

source: The most trending products in last 2 weeks
uz: Oxirgi 2 haftadagi eng ommabop mahsulotlar

source: Current system health
uz: Joriy tizim salomatligi

source: Development
uz: Rivojlanish

source: Production
uz: Ishlab chiqarish

source: Users
uz: Foydalanuvchilar

source: Groups
uz: Guruhlar

source: Site
uz: Sayt

source: MilliyTech Shop
uz: MilliyTech do‘koni

source: MilliyTech Shop Additional
uz: MilliyTech Shop qo'shimcha

source: Cart Item
uz: Savatcha ma'lumotlari

source: Russia
uz: Rossiya
